from django.http import JsonResponse
from django.shortcuts import HttpResponse
from django.shortcuts import render
import json


def standard(request):
    data = {
        "code": 0,
        "msg": "",
        "count": 1000,
        "data": [
            {
              "id": 1,
              "trait": "种皮色",
              "ac_time": "种子",
              "ac_std": "籽粒种皮的颜色，分为黄、青、黑、褐、双色",
              "precision": " ",
              "value": "黄、青、黑、褐、双色",
              "group": "比较实验、区域试验、生产试验"
            },
            {
              "id": 2,
              "trait": "脐色",
              "ac_time": "种子",
              "ac_std": "籽粒种脐的颜色，分浅黄、黄、浅褐、褐、深褐、蓝、黑",
              "precision": " ",
              "value": "浅黄、黄、浅褐、褐、深褐、蓝、黑",
              "group": "比较实验、区域试验、生产试验"
            },
            {
              "id": 3,
              "trait": "粒形",
              "ac_time": "种子",
              "ac_std": "籽粒形状，分为圆形、扁圆形、椭圆形、扁椭圆形、长椭、肾形",
              "precision": " ",
              "value": "圆形、扁圆形、椭圆形、扁椭圆形、长椭、肾形",
              "group": "比较实验、区域试验、生产试验"
            },
            {
              "id": 4,
              "trait": "光泽",
              "ac_time": "种子",
              "ac_std": "分为强光、微光、无光",
              "precision": " ",
              "value": "强光、微光、无光",
              "group": "比较实验、区域试验、生产试验"
            },
            {
              "id": 5,
              "trait": "播种期",
              "ac_time": "苗期",
              "ac_std": "播种当天的日期，以月/日表示",
              "precision": " ",
              "value": "  ",
              "group": "比较实验、区域试验、生产试验"
            },
            {
              "id": 6,
              "trait": "出苗期",
              "ac_time": "苗期",
              "ac_std": "50%以上的幼苗出土的日期，以月/日表示",
              "precision": " ",
              "value": " ",
              "group": "比较实验、区域试验、生产试验"
            },
            {
              "id": 7,
              "trait": "开花期",
              "ac_time": "开花结荚期",
              "ac_std": "50%的植株开始开花的日期，以月/日表示",
              "precision": " ",
              "value": " ",
              "group": "比较实验、区域试验、生产试验"
            },
            {
              "id": 8,
              "trait": "成熟期",
              "ac_time": "成熟期",
              "ac_std": "全株有95%的荚变为成熟颜色，摇动时开始有响声的蜘蛛达50%以上的日期，以月/日表示",
              "precision": " ",
              "value": " ",
              "group": "比较实验、区域试验、生产试验"
            },
            {
              "id": 9,
              "trait": "收获期",
              "ac_time": "成熟期",
              "ac_std": "大豆成熟后，籽粒含水量在15%以下的日期",
              "precision": " ",
              "value": " ",
              "group": "比较实验、区域试验、生产试验"
            },
            {
              "id": 10,
              "trait": "生于日数",
              "ac_time": "成熟期",
              "ac_std": "从播种日的次日到成熟日的天数",
              "precision": "1",
              "value": " ",
              "group": "比较实验、区域试验、生产试验"
            },
            {
              "id": 11,
              "trait": "叶形",
              "ac_time": "开花结荚期",
              "ac_std": "指植株中上部第8-10节复叶中间小叶的形状",
              "precision": " ",
              "value": "圆、卵圆、椭圆、披针形",
              "group": "比较实验、区域试验、生产试验"
            },
            {
              "id": 12,
              "trait": "花色",
              "ac_time": "开花结荚期",
              "ac_std": "指花瓣的颜色，分为白、紫两种",
              "precision": " ",
              "value": "白、紫",
              "group": "比较实验、区域试验、生产试验"
            },
            {
              "id": 13,
              "trait": "茸毛色",
              "ac_time": "成熟期",
              "ac_std": "成熟时调查，分为灰色和棕色",
              "precision": " ",
              "value": "灰、棕",
              "group": "比较实验、区域试验、生产试验"
            },
            {
              "id": 14,
              "trait": "结荚习性",
              "ac_time": "成熟期",
              "ac_std": "分为有限、亚有限和无限三种。有限：开花结荚顺序由中上部而下，花序长，结荚密集，主茎顶端结荚成簇；无限：开花结荚顺序由下而上，花序短，结荚分散，主茎顶端一般1-2个荚；亚有限：开花结荚由下而上，花序中等，结荚介于无限与有限之间，主茎顶端一般3-4个荚。",
              "precision": " ",
              "value": "有限、亚有限、无限",
              "group": "比较实验、区域试验、生产试验"
            },
            {
              "id": 15,
              "trait": "株型",
              "ac_time": "成熟期",
              "ac_std": "分三种：收敛、开张、半开张。收敛：下部分枝与主茎角度小，在15°以内，上下均紧凑。开 张：分枝角度45°以上，上下均较散。半开张：介于上述两者之间。",
              "precision": " ",
              "value": "收敛、开张、半开张",
              "group": "比较实验、区域试验、生产试验"
            },
            {
              "id": 16,
              "trait": "裂荚性",
              "ac_time": "成熟期",
              "ac_std": "在成熟收获期观察记载。分为不裂，中裂，易裂。不裂：裂荚率小于等于5.0%；中裂：裂荚率5.1%-50%；易裂：裂荚率大于50%；",
              "precision": " ",
              "value": "不、中、易",
              "group": "比较实验、区域试验、生产试验"
            },
            {
              "id": 17,
              "trait": "落叶性",
              "ac_time": "成熟期",
              "ac_std": "植株成熟时叶柄脱落状况，分为落叶，半落叶，不落叶三类。落叶：落叶率大于95.0%；半落叶：落叶率5.1%-95.0%；不落叶：落叶率小于等于5.0%；",
              "precision": " ",
              "value": "落、半落、不落",
              "group": "比较实验、区域试验、生产试验"
            },
            {
              "id": 18,
              "trait": "倒伏性",
              "ac_time": "成熟期",
              "ac_std": "除记载倒伏时期和原因外，在成熟前后观察植株倒伏程度，分为1-5级。 1级：不倒，全部植株直立不倒。 2级：轻倒，0＜倒伏植株率≤25%。 3级：中倒，25%＜倒伏植株率≤50%。 4级：重倒，50%＜倒伏植株率≤75%。 5级：严重倒伏，倒伏植株率＞75%。",
              "precision": " ",
              "value": "0、1、2、3、4",
              "group": "比较实验、区域试验、生产试验"
            },
            {
              "id": 19,
              "trait": "株高",
              "ac_time": "考种期",
              "ac_std": "子叶节到植株顶端的高度（不包括顶花序），以厘米表示",
              "precision": "1",
              "value": "  ",
              "group": "比较实验、区域试验、生产试验"
            },
            {
              "id": 20,
              "trait": "底荚高度",
              "ac_time": "考种期",
              "ac_std": "从子叶节到最下部豆荚着生位置的高度，以厘米表示",
              "precision": "1",
              "value": "",
              "group": "比较实验、区域试验、生产试验"
            },
            {
              "id": 21,
              "trait": "主茎节数",
              "ac_time": "考种期",
              "ac_std": "从子叶节以上起到顶端节数，不包括顶端花序",
              "precision": "1",
              "value": "",
              "group": "比较实验、区域试验、生产试验"
            },
            {
              "id": 22,
              "trait": "有效分枝",
              "ac_time": "考种期",
              "ac_std": "指主茎上结荚的分枝数，有效枝至少有2个节，不计二次分枝",
              "precision": "1",
              "value": "",
              "group": "比较实验、区域试验、生产试验"
            },
            {
              "id": 23,
              "trait": "单株有效荚数",
              "ac_time": "考种期",
              "ac_std": "指含有一粒以上饱满种子的荚数",
              "precision": "1",
              "value": "",
              "group": "比较实验、区域试验、生产试验"
            },
            {
              "id": 24,
              "trait": "单株无效荚数",
              "ac_time": "考种期",
              "ac_std": "单株无效荚数，指一株上成荚但没有形成籽粒的荚数",
              "precision": "1",
              "value": "",
              "group": "比较实验、区域试验、生产试验"
            },
            {
              "id": 25,
              "trait": "单株粒数",
              "ac_time": "考种期",
              "ac_std": "除未成形粒外，所有未熟粒、虫食粒、病粒均包括",
              "precision": "1",
              "value": "",
              "group": "比较实验、区域试验、生产试验"
            },
            {
              "id": 26,
              "trait": "单株粒重",
              "ac_time": "考种期",
              "ac_std": "将10株籽粒筛去杂质，但包括未熟、虫食及病粒，称重，计算均重（g/株）",
              "precision": "1",
              "value": "",
              "group": "比较实验、区域试验、生产试验"
            },
            {
              "id": 27,
              "trait": "百粒重",
              "ac_time": "考种期",
              "ac_std": "随机选取完整成熟籽粒100粒称重（g），称两个100粒，若两次相差超过0.5g，重新取样称重",
              "precision": "1",
              "value": "",
              "group": "比较实验、区域试验、生产试验"
            },
            {
              "id": 28,
              "trait": "紫斑粒率",
              "ac_time": "考种期",
              "ac_std": "紫斑粒数占实际粒数百分比",
              "precision": "1",
              "value": "",
              "group": "比较实验、区域试验、生产试验"
            },
            {
              "id": 29,
              "trait": "褐斑粒率",
              "ac_time": "考种期",
              "ac_std": "褐斑粒数占实际粒数百分比",
              "precision": "1",
              "value": "",
              "group": "比较实验、区域试验、生产试验"
            },
            {
              "id": 30,
              "trait": "虫食粒率",
              "ac_time": "考种期",
              "ac_std": "被虫食粒数/实际粒数*100%，以%表示，保留小数点后一位",
              "precision": "1",
              "value": "",
              "group": "比较实验、区域试验、生产试验"
            },
            {
              "id": 31,
              "trait": "其它粒率",
              "ac_time": "考种期",
              "ac_std": "发育不完全、霉烂、损伤的粒率占实际粒数的百分比",
              "precision": "1",
              "value": "",
              "group": "比较实验、区域试验、生产试验"
            },
            {
              "id": 32,
              "trait": "完全粒率",
              "ac_time": "考种期",
              "ac_std": "晚熟、饱满、未遭病虫害的粒数占实际粒数的百分比",
              "precision": "1",
              "value": "",
              "group": "比较实验、区域试验、生产试验"
            },
            {
              "id": 33,
              "trait": "实收面积",
              "ac_time": "考种期",
              "ac_std": "用于测产收获的小区面积",
              "precision": "0",
              "value": "",
              "group": "比较实验、区域试验、生产试验"
            },
            {
              "id": 34,
              "trait": "实收株数",
              "ac_time": "考种期",
              "ac_std": "用于测产收获的小区株数",
              "precision": "0",
              "value": "",
              "group": "比较实验、区域试验、生产试验"
            },
            {
              "id": 35,
              "trait": "实收产量",
              "ac_time": "考种期",
              "ac_std": "小区产量单位用克表示，保留整数。待晒干种子含水量达到13%以下并清除杂质后称重，计算小区产量时应加入取样重量",
              "precision": "0",
              "value": "",
              "group": "比较实验、区域试验、生产试验"
            },
            {
              "id": 36,
              "trait": "标准产量",
              "ac_time": "考种期",
              "ac_std": "对实收产量按13%含水量折合成的产量。对实收大豆种子随机取样1kg，用塑料袋密封送样化验含水量，然后将实收产量折算成标准产量",
              "precision": "0",
              "value": "",
              "group": "比较实验、区域试验、生产试验"
            },
            {
              "id": 37,
              "trait": "粗蛋白",
              "ac_time": "考种期",
              "ac_std": "籽粒中蛋白质占籽粒干重的百分比",
              "precision": "0",
              "value": "",
              "group": "比较实验、区域试验、生产试验"
            },
            {
              "id": 38,
              "trait": "粗脂肪",
              "ac_time": "考种期",
              "ac_std": "籽粒中脂肪占籽粒干重的百分比",
              "precision": "0",
              "value": "",
              "group": "比较实验、区域试验、生产试验"
            },
            {
              "id": 39,
              "trait": "花期花叶病毒病",
              "ac_time": "开花结荚期",
              "ac_std": "感病程度以发病率最高的病级确定，分级标准：0级：叶片无症状或其他感病标志；1级：叶片有轻微皱缩，植株生长正常；2级：叶片皱缩明显，中脉变褐，植株生长无明显异常；3级：叶片有泡状隆起，叶缘卷缩，植株稍矮化；4级：叶片皱缩畸形呈鸡爪状，全株僵缩矮化，结少量无毛畸形荚。",
              "precision": "  ",
              "value": "",
              "group": "比较实验、区域试验、生产试验"
            },
            {
              "id": 40,
              "trait": "荚期花叶病毒病",
              "ac_time": "开花结荚期",
              "ac_std": "感病程度以发病率最高的病级确定，分级标准：0级：叶片无症状或其他感病标志；1级：叶片有轻微皱缩，植株生长正常；2级：叶片皱缩明显，中脉变褐，植株生长无明显异常；3级：叶片有泡状隆起，叶缘卷缩，植株稍矮化；4级：叶片皱缩畸形呈鸡爪状，全株僵缩矮化，结少量无毛畸形荚。",
              "precision": "  ",
              "value": "",
              "group": "比较实验、区域试验、生产试验"
            },
            {
              "id": 41,
              "trait": "田间感花叶病毒病程度",
              "ac_time": "开花结荚期",
              "ac_std": "取花期花叶病毒病和荚期花叶病毒病程度最重的一次计为田间感花叶病毒病程度",
              "precision": "  ",
              "value": "",
              "group": "比较实验、区域试验、生产试验"
            },
            {
              "id": 42,
              "trait": "其它病虫害种类",
              "ac_time": "开花结荚期",
              "ac_std": "分别在盛花期和花荚期调查发病的其它病虫害",
              "precision": "  ",
              "value": "",
              "group": "比较实验、区域试验、生产试验"
            },
            {
              "id": 43,
              "trait": "其它病虫害程度",
              "ac_time": "开花结荚期",
              "ac_std": "分别在盛花期和花荚期调查其它病虫害发病的程度",
              "precision": "  ",
              "value": "",
              "group": "比较实验、区域试验、生产试验"
            },
            {
              "id": 44,
              "trait": "亩产",
              "ac_time": "考种期",
              "ac_std": "称完小区产量，应折算成亩产量，单位为kg，保留一位小数",
              "precision": "0.1",
              "value": "",
              "group": "比较实验、区域试验、生产试验"
            }
          ]
        }
    return HttpResponse(json.dumps(data, ensure_ascii=False),
                        content_type="application/json, charset=utf-8")


def tmp(request):
    return render(request, 'summary/trait_standard.html', locals())
